[
  {
    "id": 10,
    "img": "http://ww1.hdnux.com/photos/56/43/61/12212441/3/1200x0.jpg",
    "name": "Sidekick Cafe",
    "location": "1 Ferry Building, S.F.",
    "map": "https://www.google.com/maps/place/Cowgirl+Creamery+Sidekick+Cafe+%26+Milk+Bar/@37.795418,-122.395388,17z/data=!3m1!4b1!4m5!3m4!1s0x8085805f18233a79:0xe9aff9d78dd5bb13!8m2!3d37.795418!4d-122.393194",
    "description": "One would think that the grab-and-go component of Cowgirl Creamery, the beloved North Bay cheesemaker and Ferry Building cheese monger, would serve up a humdinger version of macaroni and cheese. While I’ll give the cafe points for using house-made cheese — a blend of Cowgirl’s brine-washed triple cream Red Hawk and the melt-friendly Wagon Wheel — Sidekick’s mac was, shockingly, the most disappointing of the bunch.",
    "execution": "The stovetop-style version was served warmish, not hot. The penne pasta was overcooked and limp. The sauce itself was rather gloppy in texture.",
    "exec_rating": 15,
    "value": "$8.75 for approximately 2 cups worth.",
    "value_rating": 18,
    "creativity": "Not everyone can say their version of mac is made with a blend of their own house-made cheeses.",
    "creativity_rating": 15,
    "flavor": "The Red Hawk and Wagon Wheel lent the sauce a pleasant and understated funk, but the breadcrumb topping had no discernible flavor. Frankly, for a place that specializes in cheese, I expected so much more.",
    "flavor_rating": 19,
    "total": 67
  },
  {
    "id": 9,
    "img": "http://projects.sfchronicle.com/2017/embed-maccheese/9.jpg",
    "name": "Blue Plate",
    "location": "3218 Mission St., S.F.",
    "map": "https://www.google.com/maps/place/Blue+Plate/@37.7452033,-122.4226449,17z/data=!4m13!1m7!3m6!1s0x808f7e430f7b5ddf:0xe5b7711130630ca4!2s3218+Mission+St,+San+Francisco,+CA+94110!3b1!8m2!3d37.7452033!4d-122.4204509!3m4!1s0x808f7e430e64dded:0xd2ec209c25b9732d!8m2!3d37.7451621!4d-122.4203773",
    "description": "Since opening in 1999, this Mission Street restaurant has earned scores of fans for its take on upscale comfort food. Listed as a side dish, this mac is made with Spanish Drunken Goat (Murcia al Vino), Vermont cheddar and Parmesan. It is pre-portioned in small, ceramic baking dishes and fired in the oven to order. It’s a worthy supporting player for the restaurant’s homey mains, which include fried chicken and meatloaf.",
    "execution": "The elbow macaroni were a touch overcooked, but they held their shape and sauce nicely. The sauce was gooey but not gloppy. Unfortunately, the breadcrumb topping was anemic and soggy, detracting from the overall pleasantness of the dish.",
    "exec_rating": 18,
    "value": "$10 for approximately 1 to 1½ cups worth, one of the smaller portions on this list.",
    "value_rating": 18,
    "creativity": "While the use of a cheese like Drunken Goat may seem fairly run-of-the-mill these days, Blue Plate was long ahead of the curve and deserves credit for spreading the gospel of fancy mac.",
    "creativity_rating": 19,
    "flavor": "The sauce, which was accented with nutmeg, garlic powder and Tabasco, is boldly flavored — almost to the point of being overly so.",
    "flavor_rating": 19,
    "total": 74,
    "quote": "The first"
  },
  {
    "id": 8,
    "img": "http://ww1.hdnux.com/photos/56/43/61/12183260/3/1200x0.jpg",
    "name": "The Front Porch",
    "location": "65 29th St., S.F.",
    "map": "https://www.google.com/maps/place/The+Front+Porch/@37.7438058,-122.424214,17z/data=!4m13!1m7!3m6!1s0x808f7e42c2d1d885:0x3467c0b8b2587c12!2s65+29th+St,+San+Francisco,+CA+94110!3b1!8m2!3d37.7438058!4d-122.42202!3m4!1s0x808f7e42c331c29f:0x9c99a15c4ef74e6f!8m2!3d37.7438237!4d-122.4220396",
    "description": "If you’re the kind of person who salivates at the thought of the crusty bits of cheese that form on a grilled cheese sandwich, this is the mac for you. Small shell pasta is tossed in a bechamel that’s gussied up with cheddar and jack cheese. An extra heaping of cheese is placed on top and the whole thing is then baked in a cast-iron skillet until bubbling hot and perfectly caramelized. The super-gooey middle, sandwiched between the crusty base and top, will keep your fork twirling.",
    "execution": "Many restaurants use cast-iron skillets, but Front Porch expertly creates a beautiful balance between crusty and creamy. Downsides: The pasta was slightly overcooked and the whole was a bit oily.",
    "exec_rating": 21,
    "value": "$7 (starter); $7.50 (side) for approximately 1½ to 2 cups worth.",
    "value_rating": 22,
    "creativity": "Nothing revolutionary, just straightforward, classic baked mac.",
    "creativity_rating": 16,
    "flavor": "While pleasantly cheesy, the sauce could have used more assertiveness in the seasoning department.",
    "flavor_rating": 20,
    "total": 79
  },
  {
    "id": 7,
    "img": "http://ww1.hdnux.com/photos/56/43/61/12212436/3/1200x0.jpg",
    "name": "Mission Cheese",
    "location": "736 Valencia St., S.F.",
    "map": "https://www.google.com/maps/place/Mission+Cheese/@37.7611395,-122.4240817,17z/data=!4m5!3m4!1s0x808f7e3d24255c45:0x16aa66066980d50b!8m2!3d37.761142!4d-122.421775",
    "description": "In addition to cheese plates and raclette, the Valencia Street cheese-centric cafe offers a mean mac. Served bubbling-hot in a cast-iron pan, Mission Cheese’s mac is made with four cheeses: Wagon Wheel from Cowgirl Creamery, Reading Raclette from Spring Brook Farm, and two kinds of cheddar, from Cabot Clothbound and Vella Cheese Co. Each time I dug my fork into the mixture, I left behind rails of gooey, stringy cheese. Truth be told, I had a really hard time putting my fork down on this one.",
    "execution": "The top layer of noodles was a tad dry from baking and could have done with a bit more sauce. The noodles, along with the crispy breadcrumbs, offered nice textural contrasts.",
    "exec_rating": 19,
    "value": "$10.50 for approximately 1½ to 2 cups worth.",
    "value_rating": 20,
    "creativity": "Another straightforward cast-iron creation, but what set this version apart was the blend of California and Vermont cheeses.",
    "creativity_rating": 17,
    "flavor": "This mac was more cheesy than creamy and the “proprietary blend” (as the fellow behind the counter called it) offered an immensely deep, satisfying cheesiness. In fact, it had the best cheese flavor — veering into umami bomb territory — of all the versions I tried.",
    "flavor_rating": 25,
    "total": 81,
    "quote": "Best flavor"
  },
  {
    "id": 6,
    "img": "http://projects.sfchronicle.com/2017/embed-maccheese/6.jpg",
    "name": "Rusty’s Southern",
    "location": "750 Ellis St., S.F.",
    "map": "https://www.google.com/maps/place/Rusty's+Southern/@37.7842971,-122.420772,17z/data=!4m5!3m4!1s0x80858096d584eceb:0xad8a331344bb263!8m2!3d37.7842887!4d-122.4185779",
    "description": "This 2-year-old Tenderloin joint specializes in North Carolina barbecue. Sadly, Rusty’s no longer offers pork cracklings as a topping, which was an inventive and much-missed twist to the usual breadcrumbs. That said, the mac, which is now topped with a generous amount of shredded cheese and baked until golden, is still darn good.",
    "execution": "Cheddar, Parmesan and garlic are added to a bechamel made with butter, flour and cream. While the sauce is on the thicker side — almost heading into gloppy territory — it’s not the least bit grainy. A heaping pile of elbow macaroni, which was slightly overcooked, is folded into the sauce, making this the densest mac of the group.",
    "exec_rating": 22,
    "value": "$7 for approximately 2 to 2½ cups worth.",
    "value_rating": 24,
    "creativity": "Bring back the cracklings! Seriously, they were a fantastic addition. Now for folks who still need a porky fix, bacon can be added to the mix for an extra buck.",
    "creativity_rating": 17,
    "flavor": "The flavor is mild with a subtle sweetness, thanks in part to the garlic in the bechamel.",
    "flavor_rating": 20,
    "total": 83
  },
  {
    "id": 5,
    "img": "http://ww1.hdnux.com/photos/56/43/61/12200917/3/1200x0.jpg",
    "name": "Tipsy Pig",
    "location": "2231 Chestnut St., S.F.",
    "map": "https://www.google.com/maps/place/The+Tipsy+Pig/@37.8001359,-122.4422508,17z/data=!4m13!1m7!3m6!1s0x808580d6bde69ee5:0x28485af84ab657bc!2s2231+Chestnut+St,+San+Francisco,+CA+94123!3b1!8m2!3d37.8001359!4d-122.4400568!3m4!1s0x808580d6bdede197:0xacc96d57fe39aff1!8m2!3d37.8001359!4d-122.4400568",
    "description": "Back in 2009, Michael Bauer called the Marina bar’s version “one of the best mac and cheeses on this planet.” Naturally, it was worth a revisit. Eight years later, it’s still a solid representation — although the price has nearly doubled, up from $8 to $14. Happily, if you order from the bar’s happy hour menu (5:30-6:30 p.m., Mon.-Thurs.) a dinner-size portion is just $7.",
    "execution": "With each bite, the small — bordering on dainty — tubes of pleasantly tender ditalini pasta felt like they were dancing in my mouth. However, the Parmesan gratin topping had a powder-fine texture of overly processed breadcrumbs that, when combined with the silky smooth sauce, made the mixture turn unpleasantly gritty. A less fine texture on the topping would improve things greatly.",
    "exec_rating": 21,
    "value": "$14 (dinner) for approximately 2 cups worth.",
    "value_rating": 22,
    "creativity": "The use of just a smidge of Shropshire blue cheese (see recipe) gives the sauce an unexpectedly pleasant funk that boosts what would otherwise be just another run-of-the-mill cheese sauce.",
    "creativity_rating": 20,
    "flavor": "The otherwise perfect sauce, which besides blue cheese uses a mix of Dutch Gouda and white cheddar, could have used a smidge more salt and pepper. ",
    "flavor_rating": 24,
    "total": 87
  },
  {
    "id": 4,
    "img": "http://projects.sfchronicle.com/2017/embed-maccheese/4.jpg",
    "name": "Old Skool Cafe",
    "location": "1429 Mendell St., S.F.",
    "map": "https://www.google.com/maps/place/Old+Skool+Cafe/@37.7342075,-122.3925797,17z/data=!4m13!1m7!3m6!1s0x808f7f0559500203:0xe3cc816141380de3!2s1429+Mendell+St,+San+Francisco,+CA+94124!3b1!8m2!3d37.7342075!4d-122.3903857!3m4!1s0x808f7f055c146a47:0x3bbe3beca76f33d1!8m2!3d37.7342075!4d-122.3903857",
    "description": "The biggest surprise of this entire cheesy adventure was at this jazzy supper club in the Bayview that’s run by at-risk youth ranging in age from 16 to 22. (By coincidence, the general manager for Old Skool happens to be Francis Rubio, the opening chef of Rusty’s Southern.) The fact that one can help such a special organization makes the massive calorie intake well worth it.",
    "execution": "Of all the versions tried, this had the most balanced ratio of creamy-to-cheesy, and was a real winner. The sauce generously dressed the macaroni (a hair overcooked but still held its shape). The mixture was placed in a ceramic baking dish, topped with a generous sprinkling of even more cheese, then fired in the oven to melt.",
    "exec_rating": 24,
    "value": "$10 for approximately 3 to 3½ cups worth.",
    "value_rating": 25,
    "creativity": "Another traditional version of the dish, but executed with flair by an incredibly young kitchen staff.",
    "creativity_rating": 19,
    "flavor": "The subtly seasoned bechamel, with a hint of garlic, was finished with two kinds of cheddar cheese, plus Asiago for a little funk. The dusting of paprika and chopped parsley that finished the dish was a nice touch.",
    "flavor_rating": 22,
    "total": 90,
    "quote": "Best value"
  },
  {
    "id": 3,
    "img": "http://ww1.hdnux.com/photos/56/43/61/12183271/3/1200x0.jpg",
    "name": "Maybeck’s",
    "location": "3213 Scott St., S.F.",
    "map": "https://www.google.com/maps/place/Maybeck's/@37.7995511,-122.4434636,17z/data=!4m13!1m7!3m6!1s0x808580d41dca65df:0xd1abb2b8c7c54997!2s3213+Scott+St,+San+Francisco,+CA+94123!3b1!8m2!3d37.7995511!4d-122.4412696!3m4!1s0x808580d41dca9715:0x9686683c014d7b68!8m2!3d37.7995522!4d-122.4412718",
    "description": "House-made pasta is a specialty at Maybeck’s (née Spaghetti Bros.) in the Marina. In addition to linguine with lobster and spaghetti with meatballs, the restaurant also serves up a mac and cheese variation made with fresh orecchiette. While this is the priciest of the macs tried, considering hand-made noodles are involved, it’s well worth the expense.",
    "execution": "The sauce-filled pasta, which are pleasingly tender and chewy, burst like soup dumplings when you bite into them and it’s a delight. Crunchy, well-seasoned breadcrumbs offer nice textural contrast to the super creamy dish.",
    "exec_rating": 25,
    "value": "$16 for approximately 2 cups worth.",
    "value_rating": 21,
    "creativity": "This was an incredibly elegant interpretation of a down-home dish. Slightly thicker than the usual dried noodles, the fresh orecchiette, which act like little cups for scooping up the sauce, are genius.",
    "creativity_rating": 22,
    "flavor": "The understated bechamel was enriched with sharp white cheddar and a whisper of nutmeg. Delicate and lovely.",
    "flavor_rating": 23,
    "total": 91,
    "quote": "Most elegant"
  },
  {
    "id": 2,
    "img": "http://projects.sfchronicle.com/2017/embed-maccheese/2.jpg",
    "name": "Mac Daddy",
    "location": "1453 18th St., S.F.",
    "map": "https://www.google.com/maps/place/Mac+Daddy/@37.7624014,-122.3992648,17z/data=!4m13!1m7!3m6!1s0x808f7fcbcaed805d:0x4123ca3ea7ac0431!2s1453+18th+St,+San+Francisco,+CA+94107!3b1!8m2!3d37.7624014!4d-122.3970708!3m4!1s0x808f7fcbcaed805d:0xb90f7b16f43a5d28!8m2!3d37.7624014!4d-122.3970708",
    "description": "This 9-month-old slip of a Potrero Hill restaurant’s specialty is stove-top mac, made to order. I tried two versions — the classic, made with Pecorino Romano and 2 year-aged extra sharp cheddar, and an even more decadent version, the short rib mac — made with hunks of braised short rib, mushrooms, a tangy Mount Tam blue cheese sauce and crispy onion toppings.",
    "execution": "It’s a good thing that a mac and cheese restaurant does the dish right. Kudos to the kitchen staff for perfectly al dente ribbed macaroni. The sauces were nearly perfect — smooth, creamy and not too thick. If one were to quibble, the roux for the classic could have used a smidge more time on the heat to cook out a barely perceptible raw flour flavor.",
    "exec_rating": 24,
    "value": "Prices range from $13 to $15 for approximately a heaping 4 cups worth.",
    "value_rating": 24,
    "creativity": "Diners can choose from 13 versions or DIY with over 30 add-in options, like truffled brie and fried chicken.",
    "creativity_rating": 24,
    "flavor": "Flavors for both the classic and short rib macs were fresh and bright.",
    "flavor_rating": 25,
    "total": 97
  },
  {
    "id": 1,
    "img": "http://ww1.hdnux.com/photos/56/43/61/12212004/3/1200x0.jpg",
    "name": "Homeroom",
    "location": "400 40th St., Oakland",
    "map": "https://www.google.com/maps/place/Homeroom/@37.8286058,-122.2621127,17z/data=!4m13!1m7!3m6!1s0x80857dfc831ae683:0xcefec397d0fcbc9a!2s400+40th+St,+Oakland,+CA+94609!3b1!8m2!3d37.8286058!4d-122.2599187!3m4!1s0x80857dfc830c9779:0x86db31d9371af332!8m2!3d37.828624!4d-122.260067",
    "description": "Not surprisingly, the Oakland mac and cheese specialist continue to be the restaurant to beat. I sampled the classic — made with medium-sharp cheddar cheese, it’s everything I loved about Kraft as a kid, only better — and the Hawaiian, a pitch-perfect balance of smoky, salty-sweet, creamy bliss. After six years in business — and still drawing epic crowds — it’s crystal clear that Homeroom has pretty much perfected the art of macaroni and cheese.",
    "execution": "The ridged elbow macaroni in both were just a hair shy of a perfect al dente. While the texture of the sauce on the classic was a tad grainy, the Havarti sauce for the Hawaiian was silken perfection.",
    "exec_rating": 24,
    "value": "Prices range from $9.75 to $12.75 for approximately 3½ to 4 cups worth.",
    "value_rating": 25,
    "creativity": "There are a dozen versions to choose from, and nearly 30 add-in options, like hot dogs and potato chips (“Trailer Style”). A vegan option is available, a nice touch for non-dairy folks. Best of both worlds: The standard preparation at Homeroom is stove-top, but diners can have their dish baked with breadcrumbs for an extra 75 cents.",
    "creativity_rating": 25,
    "flavor": "The flavors for both the classic and Hawaiian were balanced, bright and perfectly seasoned.",
    "flavor_rating": 25,
    "total": 99,
    "quote": "The winner"
  }
]